[
  {
    "headline":"Trudeau calls Trump's tariffs 'insulting' to longstanding US-Canada alliance",
    "trailText":"Trudeau reiterated his appeal to Trump to remember ‘there are no two countries that are as interconnected and interdependent’"
  },
  {
    "headline":"Trump to Trudeau in testy tariff call: 'Didn't you guys burn down the White House?'",
    "trailText":"President reportedly invoked war of 1812 when Canadian PM asked how he could justify tariffs on national security grounds"
  },
  {
    "headline":"The G7 minus one: Trump packs wrecking ball for Canada summit",
    "trailText":"Justin Trudeau and EU and Japanese allies stymied in trade tussle where ‘everyone loses’ "
  },
  {
    "headline":"Macron calls on G7 members to confront Trump over trade",
    "trailText":"French president warned other G7 members to resist a potential US drift toward ‘crude hegemony’ following Trump’s tariffs on allies"
  },
  {
    "headline":"Donald Trump at G7: 'US is not a piggy bank to be robbed'",
    "trailText":"US president appears to snub Theresa May and called for tariff-free trade with members"
  },
  {
    "headline":"G7 in disarray after Trump rejects communique and attacks 'weak' Trudeau",
    "trailText":"Leaders believed they had a deal until the US president launched a personal attack on Canada’s prime minister"
  },
  {
    "headline":"Trump's trade tirade casts Canada in unfamiliar role of America's bad guy",
    "trailText":"It was all smiles as Justin Trudeau welcomed the US president to the G7 summit but mutual goodwill appears to be at a low ebb"
  },
  {
    "headline":"Trump is a bully who thought Canada was weak. He was wrong about us",
    "trailText":"The president’s temper tantrum shows Canada can’t trust its closest ally – and we’ll go to the wall for our overpriced cheese if it becomes a point of national self-respect"
  },
  {
    "headline":"Trudeau 'stabbed us in back' on trade, says Trump chief economic adviser",
    "trailText":"Kim Jong-un ‘must not see American weakness’, Larry Kudlow says in fierce attack, while trade adviser Navarro promises a ‘special place in hell’ for Canadian PM"
  },
  {
    "headline":"Trump, Merkel, Macron: the G7 photos worth a thousand words",
    "trailText":"A photo released by Angela Merkel caused a social media sensation. But did the summit look as grim to the other leaders? asks Hannah Jane Parkinson"
  },
  {
    "headline":"Canada and America are cousins. We don't stab each other in the back",
    "trailText":"It is not just the centuries-long relationship that the president is wrecking – it is an international order of democracies, writes author and professor Margaret MacMillan"
  },
  {
    "headline":"Hanger-on May is no more than a bit player at the G7 summit",
    "trailText":"Donald Trump and the other world leaders found little time for the prime minister in Canada"
  },
  {
    "headline":"'Prepare for the worst': souring Canada-US relations fuel worries of trade war",
    "trailText":"US officials back Trump’s outraged G7 remarks as Canada struggles to mend relationship with its largest trading partner"
  },
  {
    "headline":"Colbert on Trump at the G7: 'Like a toddler who put a Lego in his mouth'",
    "trailText":"Stephen Colbert, Trevor Noah and Seth Meyers discussed tensions between Trump and Trudeau at G7"
  },
  {
    "headline":"Trump's trade adviser apologizes for saying Trudeau has 'special place in hell'",
    "trailText":"Peter Navarro says he used ‘inappropriate language’ and that it was a mistake to lash out at Canada’s prime minister"
  },
  {
    "headline":"Justin Trudeau promised to protect indigenous rights. He lied, again",
    "trailText":"One oil spill from the Trans Mountain pipeline would destroy Squamish territory. So much for Trudeau’s promise <br>"
  },
  {
    "headline":"Oil pipelines can be positive for indigenous people. Here's how",
    "trailText":"Canadians haven’t heard enough about the positive influence that similar projects have had on many indigenous groups"
  },
  {
    "headline":"Revealed: Canada uses secretive anti-terrorist database run by US",
    "trailText":"Tuscan is effectively a second Canadian no-fly list with 680,000 names, despite problems with the official list"
  },
  {
    "headline":"Trump, Twitter and the art of constructive disagreement",
    "trailText":"It’s all about making the best of a bad situation – and an even worse conversation"
  },
  {
    "headline":"Inside Tuscan: the other no-fly list Canada didn't tell you about",
    "trailText":"Canada’s use of an anti-terrorism database controlled entirely by the FBI have critics worried about sovereignty, privacy and civil liberties"
  }
]